{"class_name": "Model", "backend": "theano", "config": {"output_layers": [["dense_8", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_5", "config": {"sparse": false, "dtype": "float32", "name": "input_5", "batch_input_shape": [null, 1, 10, 128, 128]}, "inbound_nodes": []}, {"class_name": "Conv3D", "name": "conv3d_19", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_19", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 32}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_20", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_20", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 32}, "inbound_nodes": [[["conv3d_19", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "name": "max_pooling3d_10", "config": {"padding": "valid", "strides": [1, 2, 2], "data_format": "channels_first", "name": "max_pooling3d_10", "pool_size": [1, 2, 2], "trainable": true}, "inbound_nodes": [[["conv3d_20", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_21", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_21", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 64}, "inbound_nodes": [[["max_pooling3d_10", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_22", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_22", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 64}, "inbound_nodes": [[["conv3d_21", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "name": "max_pooling3d_11", "config": {"padding": "valid", "strides": [1, 2, 2], "data_format": "channels_first", "name": "max_pooling3d_11", "pool_size": [1, 2, 2], "trainable": true}, "inbound_nodes": [[["conv3d_22", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_23", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_23", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 128}, "inbound_nodes": [[["max_pooling3d_11", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_24", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_24", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 128}, "inbound_nodes": [[["conv3d_23", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "name": "max_pooling3d_12", "config": {"padding": "valid", "strides": [1, 2, 2], "data_format": "channels_first", "name": "max_pooling3d_12", "pool_size": [1, 2, 2], "trainable": true}, "inbound_nodes": [[["conv3d_24", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_25", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_25", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 256}, "inbound_nodes": [[["max_pooling3d_12", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_26", "config": {"strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1, 1], "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "conv3d_26", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "kernel_size": [1, 3, 3], "filters": 256}, "inbound_nodes": [[["conv3d_25", 0, 0, {}]]]}, {"class_name": "MaxPooling3D", "name": "max_pooling3d_13", "config": {"padding": "valid", "strides": [1, 2, 2], "data_format": "channels_first", "name": "max_pooling3d_13", "pool_size": [1, 2, 2], "trainable": true}, "inbound_nodes": [[["conv3d_26", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["max_pooling3d_13", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"activation": "relu", "activity_regularizer": null, "units": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_7", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"activation": "sigmoid", "activity_regularizer": null, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_8", "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "name": "model_4"}, "keras_version": "2.0.3"}